"""Столько вторников в этом столбце?"""

def how_much_thu(list):
    count_of_thu = 0
    for i in list:
        date = i.split()
        if date[0] == 'Thu':
            count_of_thu+=1
    return count_of_thu

list_days = [
    'Mon Aug  6 07:11:19 2018', 'Thu Dec  1 01:32:03 2016',
    'Wed Aug  2 22:37:44 2028', 'Thu Feb 19 06:32:31 2009',
    'Wed Nov 19 04:33:36 2025', 'Wed Dec  3 21:09:06 2008',
    'Fri Oct 19 14:30:11 2029', 'Thu Nov 15 06:24:21 2012',
    'Tue Apr 13 06:16:56 2010', 'Wed Mar 21 20:39:13 2012',
    'Mon Oct 20 15:16:39 2008', 'Sat Jun 16 21:49:21 2012',
    'Fri Oct 12 23:04:10 2012', 'Sat Nov 28 00:15:35 2026',
    'Wed Jun 24 13:59:53 2026', 'Sat Dec  7 20:12:14 2024',
    'Wed Feb  9 03:14:37 2005', 'Wed Jul  8 03:37:32 2026',
    'Thu Feb 15 04:28:05 2029', 'Mon Nov  4 19:51:21 2013',
    'Fri Apr 24 16:34:04 2015', 'Thu Nov 11 06:03:08 2021',
    'Thu Sep 29 02:06:57 2022', 'Wed Dec  9 13:23:17 2015',
    'Tue Mar  1 17:21:33 2005', 'Wed Dec 19 12:06:13 2029',
    'Mon Dec 10 06:54:33 2029', 'Mon Aug 14 10:28:42 2028',
    'Thu Apr 14 19:07:30 2022', 'Tue Mar 26 23:00:51 2013',
    'Tue Apr 15 07:44:49 2003', 'Mon Mar 27 22:28:47 2006',
    'Fri Aug  3 14:54:33 2029', 'Tue Sep 12 14:32:59 2028',
    'Wed Jul  6 01:38:02 2016', 'Tue Mar 15 20:37:33 2005',
    'Mon Jun  8 18:47:13 2020', 'Mon May  6 09:12:39 2024',
    'Thu Sep 12 21:12:21 2002', 'Fri Sep 20 10:42:56 2030',
    'Fri Aug 10 05:50:40 2007', 'Wed Feb  7 00:44:20 2007',
    'Tue Mar  3 07:06:41 2015', 'Wed Jun  2 14:38:56 2021',
    'Thu Jul  9 20:52:25 2026', 'Fri May  2 18:53:43 2003',
    'Wed May 12 23:06:53 2021', 'Wed Oct  6 18:11:08 2010',
    'Sun Jul 14 18:58:28 2030', 'Wed May 28 02:25:55 2003',
    'Wed May 10 23:59:45 2017', 'Sun Aug 14 14:13:04 2011',
    'Sat Oct 24 06:28:55 2009', 'Sun May  8 21:15:51 2011',
    'Fri Jun 14 19:13:17 2030', 'Fri Jun 30 22:49:15 2017',
    'Tue Jun  3 18:23:26 2025', 'Thu Apr 29 04:30:33 2004',
    'Mon Jul 23 11:32:38 2007', 'Sun Feb  7 01:53:13 2027',
    'Wed Jun 17 01:05:46 2009', 'Thu Dec 29 18:39:09 2022',
    'Sat Sep 11 18:56:05 2027', 'Wed Feb 18 02:12:36 2004',
    'Sun Aug 31 06:23:01 2025', 'Wed Feb 26 12:41:48 2003',
    'Mon May  1 16:34:15 2023', 'Mon Aug 13 21:55:49 2018',
    'Thu Dec 13 05:50:55 2029', 'Sat Sep 17 14:22:14 2005',
    'Thu Feb 24 11:42:06 2028', 'Sat Dec  4 08:04:39 2027'
]

print(how_much_thu(list_days))
